In [70]:
import sqlite3
con = sqlite3.connect("products.db")
cur = con.cursor()

In [71]:
cur.execute("DROP TABLE IF EXISTS Departments")
cur.execute("DROP TABLE IF EXISTS Employees")

In [72]:
cur.executescript("""
CREATE TABLE IF NOT EXISTS Departments (
  Code INTEGER,
  Name TEXT NOT NULL,
  Budget decimal NOT NULL,
  PRIMARY KEY (Code)
);

CREATE TABLE IF NOT EXISTS Employees (
  SSN INTEGER,
  Name varchar(255) NOT NULL ,
  LastName varchar(255) NOT NULL ,
  Department INTEGER NOT NULL ,
  PRIMARY KEY (SSN)
);


INSERT INTO Departments(Code,Name,Budget) VALUES(14,'IT',65000);
INSERT INTO Departments(Code,Name,Budget) VALUES(37,'Accounting',15000);
INSERT INTO Departments(Code,Name,Budget) VALUES(59,'Human Resources',240000);
INSERT INTO Departments(Code,Name,Budget) VALUES(77,'Research',55000);

INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('123234877','Michael','Rogers',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('152934485','Anand','Manikutty',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('222364883','Carol','Smith',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('326587417','Joe','Stevens',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332154719','Mary-Anne','Foster',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332569843','George','ODonnell',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('546523478','John','Doe',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('631231482','David','Smith',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('654873219','Zacary','Efron',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('745685214','Eric','Goldsmith',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657245','Elizabeth','Doe',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657246','Kumar','Swamy',14);
""")
con.commit()

# -- 2.1 Select the last name of all employees.

In [73]:
cur.execute("SELECT LastName FROM Employees")
print(cur.fetchall())

[('Rogers',), ('Manikutty',), ('Smith',), ('Stevens',), ('Foster',), ('ODonnell',), ('Doe',), ('Smith',), ('Efron',), ('Goldsmith',), ('Doe',), ('Swamy',)]

# -- 2.2 Select the last name of all employees, without duplicates.

In [74]:
cur.execute("SELECT DISTINCT LastName FROM Employees")
print(cur.fetchall())

[('Rogers',), ('Manikutty',), ('Smith',), ('Stevens',), ('Foster',), ('ODonnell',), ('Doe',), ('Efron',), ('Goldsmith',), ('Swamy',)]

# -- 2.3 Select all the data of employees whose last name is "Smith".

In [75]:
cur.execute("SELECT * FROM Employees WHERE LastName = 'Smith'")
print(cur.fetchall())

[(222364883, 'Carol', 'Smith', 37), (631231482, 'David', 'Smith', 77)]

# -- 2.4 Select all the data of employees whose last name is "Smith" or "Doe".

In [76]:
cur.execute("SELECT * FROM Employees WHERE LastName = 'Smith' OR LastName = 'Doe'")
print(cur.fetchall())

[(222364883, 'Carol', 'Smith', 37), (546523478, 'John', 'Doe', 59), (631231482, 'David', 'Smith', 77), (845657245, 'Elizabeth', 'Doe', 14)]

# -- 2.5 Select all the data of employees that work in department 14.

In [77]:
cur.execute("SELECT * FROM Employees WHERE Department = 14")
print(cur.fetchall())

[(123234877, 'Michael', 'Rogers', 14), (152934485, 'Anand', 'Manikutty', 14), (332154719, 'Mary-Anne', 'Foster', 14), (845657245, 'Elizabeth', 'Doe', 14), (845657246, 'Kumar', 'Swamy', 14)]

# -- 2.6 Select all the data of employees that work in department 37 or department 77.

In [78]:
cur.execute("SELECT * FROM Employees WHERE Department = 37 OR Department = 77")
print(cur.fetchall())

[(222364883, 'Carol', 'Smith', 37), (326587417, 'Joe', 'Stevens', 37), (332569843, 'George', 'ODonnell', 77), (631231482, 'David', 'Smith', 77)]

# -- 2.7 Select all the data of employees whose last name begins with an "S".

In [79]:
cur.execute("SELECT * FROM Employees WHERE LastName LIKE 'S%'")
print(cur.fetchall())

[(222364883, 'Carol', 'Smith', 37), (326587417, 'Joe', 'Stevens', 37), (631231482, 'David', 'Smith', 77), (845657246, 'Kumar', 'Swamy', 14)]

# -- 2.8 Select the sum of all the departments' budgets.

In [80]:
cur.execute("SELECT SUM(Budget) FROM Departments")
print(cur.fetchone()[0])

375000

# -- 2.9 Select the number of employees in each department (you only need to show the department code and the number of employees).

In [81]:
cur.execute("SELECT Department, COUNT(*) FROM Employees GROUP BY Department")
print(cur.fetchall())

[(14, 5), (37, 2), (59, 3), (77, 2)]

# -- 2.10 Select all the data of employees, including each employee's department's data.

In [82]:
cur.execute("""
    SELECT *
    FROM Employees
    JOIN Departments ON Employees.Department = Departments.Code
""")
display(cur.fetchall())

[(123234877, 'Michael', 'Rogers', 14, 14, 'IT', 65000),
 (152934485, 'Anand', 'Manikutty', 14, 14, 'IT', 65000),
 (222364883, 'Carol', 'Smith', 37, 37, 'Accounting', 15000),
 (326587417, 'Joe', 'Stevens', 37, 37, 'Accounting', 15000),
 (332154719, 'Mary-Anne', 'Foster', 14, 14, 'IT', 65000),
 (332569843, 'George', 'ODonnell', 77, 77, 'Research', 55000),
 (546523478, 'John', 'Doe', 59, 59, 'Human Resources', 240000),
 (631231482, 'David', 'Smith', 77, 77, 'Research', 55000),
 (654873219, 'Zacary', 'Efron', 59, 59, 'Human Resources', 240000),
 (745685214, 'Eric', 'Goldsmith', 59, 59, 'Human Resources', 240000),
 (845657245, 'Elizabeth', 'Doe', 14, 14, 'IT', 65000),
 (845657246, 'Kumar', 'Swamy', 14, 14, 'IT', 65000)]

# -- 2.11 Select the name and last name of each employee, along with the name and budget of the employee's department.

In [83]:
cur.execute("""
    SELECT Employees.Name, Employees.LastName, Departments.Name, Departments.Budget
    FROM Employees
    JOIN Departments ON Employees.Department = Departments.Code
""")
display(cur.fetchall())

[('Michael', 'Rogers', 'IT', 65000),
 ('Anand', 'Manikutty', 'IT', 65000),
 ('Carol', 'Smith', 'Accounting', 15000),
 ('Joe', 'Stevens', 'Accounting', 15000),
 ('Mary-Anne', 'Foster', 'IT', 65000),
 ('George', 'ODonnell', 'Research', 55000),
 ('John', 'Doe', 'Human Resources', 240000),
 ('David', 'Smith', 'Research', 55000),
 ('Zacary', 'Efron', 'Human Resources', 240000),
 ('Eric', 'Goldsmith', 'Human Resources', 240000),
 ('Elizabeth', 'Doe', 'IT', 65000),
 ('Kumar', 'Swamy', 'IT', 65000)]

# -- 2.12 Select the name and last name of employees working for departments with a budget greater than $60,000.

In [84]:
cur.execute("""
    SELECT Employees.Name, Employees.LastName
    FROM Employees
    JOIN Departments ON Employees.Department = Departments.Code
    WHERE Departments.Budget > 60000
""")
display(cur.fetchall())

[('Michael', 'Rogers'),
 ('Anand', 'Manikutty'),
 ('Mary-Anne', 'Foster'),
 ('John', 'Doe'),
 ('Zacary', 'Efron'),
 ('Eric', 'Goldsmith'),
 ('Elizabeth', 'Doe'),
 ('Kumar', 'Swamy')]

# -- 2.13 Select the departments with a budget larger than the average budget of all the departments.

In [85]:
cur.execute("""
    SELECT *
    FROM Departments
    WHERE Budget > (SELECT AVG(Budget) FROM Departments)
""")
display(cur.fetchall())

[(59, 'Human Resources', 240000)]

# -- 2.14 Select the names of departments with more than two employees.

In [86]:
cur.execute("""
    SELECT Departments.Name
    FROM Departments
    JOIN Employees ON Departments.Code = Employees.Department
    GROUP BY Departments.Name
    HAVING COUNT(*) > 2
""")
display(cur.fetchall())

[('Human Resources',), ('IT',)]

# -- 2.15 Select the name and last name of employees working for the two departments with lowest budget.

In [87]:
cur.execute("""
    SELECT Employees.Name, Employees.LastName
    FROM Employees
    JOIN Departments ON Employees.Department = Departments.Code
    WHERE Departments.Budget IN (SELECT Budget FROM Departments ORDER BY Budget ASC LIMIT 2)
""")
display(cur.fetchall())

[('Carol', 'Smith'),
 ('Joe', 'Stevens'),
 ('George', 'ODonnell'),
 ('David', 'Smith')]

# -- 2.16  Add a new department called "Quality Assurance", with a budget of $40,000 and departmental code 11.

In [88]:
cur.execute("""
    INSERT INTO Departments(Code,Name,Budget) VALUES(11,'Quality Assurance',40000)
""")
con.commit()

In [89]:
# -- And Add an employee called "Mary Moore" in that department, with SSN 847-21-9811.

In [90]:
cur.execute("""
    INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('847219811','Mary','Moore',11)
""")
con.commit()

# -- 2.17 Reduce the budget of all departments by 10%.

In [91]:
cur.execute("""
    UPDATE Departments
    SET Budget = ROUND(Budget * 0.9, 2)
""")
con.commit()

# -- 2.18 Reassign all employees from the Research department (code 77) to the IT department (code 14).

In [92]:
cur.execute("""
    UPDATE Employees
    SET Department = 14
    WHERE Department = 77
""")
con.commit()

In [93]:
# -- 2.19 Delete from the table all employees in the IT department (code 14).

In [94]:
cur.execute("""
    DELETE FROM Employees
    WHERE Department = 14
""")

In [95]:
# -- 2.20 Delete from the table all employees who work in departments with a budget greater than or equal to $60,000.

In [96]:
cur.execute("""
    DELETE FROM Employees
    WHERE Department IN (SELECT Code FROM Departments WHERE Budget >= 60000)
""")
con.commit()

# -- 2.21 Delete from the table all employees.

In [97]:
cur.execute("""
    DELETE FROM Employees
""")
con.commit()